app/Controllers/Home.php

    public function index()
    {
        // Ambil jumlah record dari masing-masing tabel
        $karyawanModel = new KaryawanBaruModel();
        $kriteriaModel = new DataKriteriaModel();
        $penilaianModel = new PenilaianKaryawanModel();

        // Ambil jumlah data
        $jumlahKaryawan = $karyawanModel->countAllResults(); // Menghitung jumlah karyawan
        $jumlahKriteria = $kriteriaModel->countAllResults(); // Menghitung jumlah kriteria
        $jumlahPenilaian = $penilaianModel->countAllResults(); // Menghitung jumlah penilaian
---
SELECT COUNT(*) AS `numrows`
FROM `karyawan_baru`
SELECT COUNT(*) AS `numrows`
FROM `data_kriteria`
SELECT COUNT(*) AS `numrows`
FROM `penilaian_karyawan`

    public function karyawanbaru()
    {
        $model = new KaryawanBaruModel();
        $data['karyawan'] = $model->findAll();
---
SELECT *
FROM `karyawan_baru`

    public function datakriteria() {
        $model = new DataKriteriaModel();
        $data['datakriteria'] = $model->findAll();
---
SELECT *
FROM `data_kriteria`

    private function getAllKriteria() {
        $db = \Config\Database::connect();
        return $db->table('data_kriteria')
            ->select('nama_kriteria')
            ->orderBy('id', 'ASC') // Urutkan sesuai kebutuhan
            ->get()
            ->getResultArray();
---
SELECT `nama_kriteria`
FROM `data_kriteria`
ORDER BY `id` ASC