app/Models/PenilaianKaryawanModel.php

    public function getPenilaian()
    {
        $data = $this->db->table($this->table)
            ->select('penilaian_karyawan.*, karyawan_baru.nama_karyawan, data_kriteria.nama_kriteria, penilaian_karyawan.nilai')
            ->join('karyawan_baru', 'karyawan_baru.id = penilaian_karyawan.karyawan_id')
            ->join('data_kriteria', 'data_kriteria.id = penilaian_karyawan.kriteria_id')
            ->orderBy('karyawan_baru.id, data_kriteria.id') // Urutkan berdasarkan karyawan dan kriteria
            ->get()
            ->getResultArray();
---
SELECT `penilaian_karyawan`.*, `karyawan_baru`.`nama_karyawan`, `data_kriteria`.`nama_kriteria`, `penilaian_karyawan`.`nilai`
FROM `penilaian_karyawan`
JOIN `karyawan_baru` ON `karyawan_baru`.`id` = `penilaian_karyawan`.`karyawan_id`
JOIN `data_kriteria` ON `data_kriteria`.`id` = `penilaian_karyawan`.`kriteria_id`
ORDER BY `karyawan_baru`.`id`, `data_kriteria`.`id`